stm32-hotspot/STM32U3-M2-Serial-Mem-EMS-Test-Code/Naquada/Parts/lis2du12_reg.h
/* Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 */

/*
 ******************************************************************************
 * @file    lis2du12_reg.h
 * @author  Sensors Software Solution Team
 * @brief   This file contains all the functions prototypes for the
 *          lis2du12_reg.c driver.
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef LIS2DU12_REGS_H
#define LIS2DU12_REGS_H

#ifdef __cplusplus
  extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include <stdint.h>
#include <stddef.h>
#include <math.h>

/** @addtogroup LIS2DU12
  * @{
  *
  */

/** @defgroup  Endianness definitions
  * @{
  *
  */

#ifndef DRV_BYTE_ORDER
#ifndef __BYTE_ORDER__

#define DRV_LITTLE_ENDIAN 1234
#define DRV_BIG_ENDIAN    4321

/** if _BYTE_ORDER is not defined, choose the endianness of your architecture
  * by uncommenting the define which fits your platform endianness
  */
//#define DRV_BYTE_ORDER    DRV_BIG_ENDIAN
#define DRV_BYTE_ORDER    DRV_LITTLE_ENDIAN

#else /* defined __BYTE_ORDER__ */

#define DRV_LITTLE_ENDIAN  __ORDER_LITTLE_ENDIAN__
#define DRV_BIG_ENDIAN     __ORDER_BIG_ENDIAN__
#define DRV_BYTE_ORDER     __BYTE_ORDER__

#endif /* __BYTE_ORDER__*/
#endif /* DRV_BYTE_ORDER */

/**
  * @}
  *
  */

/** @defgroup STMicroelectronics sensors common types
  * @{
  *
  */

#ifndef MEMS_SHARED_TYPES
#define MEMS_SHARED_TYPES

typedef struct{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t bit0       : 1;
  uint8_t bit1       : 1;
  uint8_t bit2       : 1;
  uint8_t bit3       : 1;
  uint8_t bit4       : 1;
  uint8_t bit5       : 1;
  uint8_t bit6       : 1;
  uint8_t bit7       : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7       : 1;
  uint8_t bit6       : 1;
  uint8_t bit5       : 1;
  uint8_t bit4       : 1;
  uint8_t bit3       : 1;
  uint8_t bit2       : 1;
  uint8_t bit1       : 1;
  uint8_t bit0       : 1;
#endif /* DRV_BYTE_ORDER */
} bitwise_t;

#define PROPERTY_DISABLE                (0U)
#define PROPERTY_ENABLE                 (1U)

/** @addtogroup  Interfaces_Functions
  * @brief       This section provide a set of functions used to read and
  *              write a generic register of the device.
  *              MANDATORY: return 0 -> no Error.
  * @{
  *
  */

typedef int32_t (*stmdev_write_ptr)(void *, uint8_t, const uint8_t *, uint16_t);
typedef int32_t (*stmdev_read_ptr)(void *, uint8_t, uint8_t *, uint16_t);
typedef void (*stmdev_mdelay_ptr)(uint32_t millisec);

typedef struct
{
  /** Component mandatory fields **/
  stmdev_write_ptr  write_reg;
  stmdev_read_ptr   read_reg;
  /** Component optional fields **/
  stmdev_mdelay_ptr   mdelay;
  /** Customizable optional pointer **/
  void *handle;
} stmdev_ctx_t;

/**
  * @}
  *
  */

#endif /* MEMS_SHARED_TYPES */

#ifndef MEMS_UCF_SHARED_TYPES
#define MEMS_UCF_SHARED_TYPES

/** @defgroup    Generic address-data structure definition
  * @brief       This structure is useful to load a predefined configuration
  *              of a sensor.
  *              You can create a sensor configuration by your own or using
  *              Unico / Unicleo tools available on STMicroelectronics
  *              web site.
  *
  * @{
  *
  */

typedef struct {
  uint8_t address;
  uint8_t data;
} ucf_line_t;

/**
  * @}
  *
  */

#endif /* MEMS_UCF_SHARED_TYPES */

/**
  * @}
  *
  */

/** @defgroup LIS2DU12_Infos
  * @{
  *
  */

/** I2C Device Address 8 bit format  if SA0=0 -> 0x if SA0=1 -> 0x **/
#define LIS2DU12_I2C_ADD_L     0x31U
#define LIS2DU12_I2C_ADD_H     0x33U

/** Device Identification (Who am I) **/
#define LIS2DU12_ID            0x45U

/**
  * @}
  *
  */

#define LIS2DU12_IF_PU_CTRL    0x0CU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used_01      : 2;
  uint8_t cs_pu_disc       : 1;
  uint8_t not_used_02      : 3;
  uint8_t sda_pu_en        : 1;
  uint8_t sdo_pu_disc      : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sdo_pu_disc      : 1;
  uint8_t sda_pu_en        : 1;
  uint8_t not_used_02      : 3;
  uint8_t cs_pu_disc       : 1;
  uint8_t not_used_01      : 2;
#endif /* DRV_BYTE_ORDER */
} lis2du12_if_pu_ctrl_t;

#define LIS2DU12_IF_CTRL       0x0EU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t i2c_disable      : 1;
  uint8_t i3c_disable      : 1;
  uint8_t pd_dis_int1      : 1;
  uint8_t not_used_01      : 5;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01      : 5;
  uint8_t pd_dis_int1      : 1;
  uint8_t i3c_disable      : 1;
  uint8_t i2c_disable      : 1;
#endif /* DRV_BYTE_ORDER */
} lis2du12_if_ctrl_t;

#define LIS2DU12_CTRL1         0x10U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t wu_z_en      : 1;
  uint8_t wu_y_en      : 1;
  uint8_t wu_x_en      : 1;
  uint8_t drdy_pulsed  : 1;
  uint8_t if_add_inc   : 1;
  uint8_t sw_reset     : 1;
  uint8_t sim          : 1;
  uint8_t pp_od        : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t pp_od        : 1;
  uint8_t sim          : 1;
  uint8_t sw_reset     : 1;
  uint8_t if_add_inc   : 1;
  uint8_t drdy_pulsed  : 1;
  uint8_t wu_x_en      : 1;
  uint8_t wu_y_en      : 1;
  uint8_t wu_z_en      : 1;
#endif /* DRV_BYTE_ORDER */
} lis2du12_ctrl1_t;

#define LIS2DU12_CTRL2         0x11U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used_01    : 3;
  uint8_t int1_drdy      : 1;
  uint8_t int1_f_ovr     : 1;
  uint8_t int1_f_fth     : 1;
  uint8_t int1_f_full    : 1;
  uint8_t int1_boot      : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t int1_boot      : 1;
  uint8_t int1_f_full    : 1;
  uint8_t int1_f_fth     : 1;
  uint8_t int1_f_ovr     : 1;
  uint8_t int1_drdy      : 1;
  uint8_t not_used_01    : 3;
#endif /* DRV_BYTE_ORDER */
} lis2du12_ctrl2_t;

#define LIS2DU12_CTRL3         0x12U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t st            : 2;
  uint8_t not_used_01   : 1;
  uint8_t int2_drdy     : 1;
  uint8_t int2_f_ovr    : 1;
  uint8_t int2_f_fth    : 1;
  uint8_t int2_f_full   : 1;
  uint8_t int2_boot     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t int2_boot     : 1;
  uint8_t int2_f_full   : 1;
  uint8_t int2_f_fth    : 1;
  uint8_t int2_f_ovr    : 1;
  uint8_t int2_drdy     : 1;
  uint8_t not_used_01   : 1;
  uint8_t st            : 2;
#endif /* DRV_BYTE_ORDER */
} lis2du12_ctrl3_t;

#define LIS2DU12_CTRL4         0x13U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t boot          : 1;
  uint8_t soc           : 1;
  uint8_t not_used_01   : 3;
  uint8_t bdu           : 1;
  uint8_t inact_odr     : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t inact_odr     : 2;
  uint8_t bdu           : 1;
  uint8_t not_used_01   : 3;
  uint8_t soc           : 1;
  uint8_t boot          : 1;
#endif /* DRV_BYTE_ORDER */
} lis2du12_ctrl4_t;

#define LIS2DU12_CTRL5         0x14U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fs            : 2;
  uint8_t bw            : 2;
  uint8_t odr           : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t odr           : 4;
  uint8_t bw            : 2;
  uint8_t fs            : 2;
#endif /* DRV_BYTE_ORDER */
} lis2du12_ctrl5_t;

