stm32-hotspot/STM32U3-M2-Serial-Mem-EMS-Test-Code/Naquada/Parts/lis2du12_reg.h
#define LIS2DU12_FIFO_CTRL     0x15U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t f_mode        : 3;
  uint8_t stop_on_fth   : 1;
  uint8_t not_used_01   : 2;
  uint8_t fifo_depth    : 1;
  uint8_t rounding_xyz  : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t rounding_xyz  : 1;
  uint8_t fifo_depth    : 1;
  uint8_t not_used_01   : 2;
  uint8_t stop_on_fth   : 1;
  uint8_t f_mode        : 3;
#endif /* DRV_BYTE_ORDER */
} lis2du12_fifo_ctrl_t;

#define LIS2DU12_FIFO_WTM      0x16U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fth          : 7;
  uint8_t not_used_01  : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01  : 1;
  uint8_t fth          : 7;
#endif /* DRV_BYTE_ORDER */
} lis2du12_fifo_wtm_t;

#define LIS2DU12_INTERRUPT_CFG 0x17U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t interrupts_enable   : 1;
  uint8_t lir                 : 1;
  uint8_t h_lactive           : 1;
  uint8_t sleep_status_on_int : 1;
  uint8_t not_used_01         : 1;
  uint8_t wake_ths_w          : 1;
  uint8_t int_short_en        : 1;
  uint8_t not_used_02         : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_02         : 1;
  uint8_t int_short_en        : 1;
  uint8_t wake_ths_w          : 1;
  uint8_t not_used_01         : 1;
  uint8_t sleep_status_on_int : 1;
  uint8_t h_lactive           : 1;
  uint8_t lir                 : 1;
  uint8_t interrupts_enable   : 1;
#endif /* DRV_BYTE_ORDER */
} lis2du12_interrupt_cfg_t;

#define LIS2DU12_TAP_THS_X     0x18U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t tap_ths_x          : 5;
  uint8_t d6d_ths            : 2;
  uint8_t d4d_en             : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t d4d_en             : 1;
  uint8_t d6d_ths            : 2;
  uint8_t tap_ths_x          : 5;
#endif /* DRV_BYTE_ORDER */
} lis2du12_tap_ths_x_t;

#define LIS2DU12_TAP_THS_Y     0x19U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t tap_ths_y         : 5;
  uint8_t tap_priority      : 3;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t tap_priority      : 3;
  uint8_t tap_ths_y         : 5;
#endif /* DRV_BYTE_ORDER */
} lis2du12_tap_ths_y_t;

#define LIS2DU12_TAP_THS_Z     0x1AU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t tap_ths_z      : 5;
  uint8_t tap_z_en       : 1;
  uint8_t tap_y_en       : 1;
  uint8_t tap_x_en       : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t tap_x_en       : 1;
  uint8_t tap_y_en       : 1;
  uint8_t tap_z_en       : 1;
  uint8_t tap_ths_z      : 5;
#endif /* DRV_BYTE_ORDER */
} lis2du12_tap_ths_z_t;

#define LIS2DU12_INT_DUR       0x1BU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t shock        : 2;
  uint8_t quiet        : 2;
  uint8_t latency      : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t latency      : 4;
  uint8_t quiet        : 2;
  uint8_t shock        : 2;
#endif /* DRV_BYTE_ORDER */
} lis2du12_int_dur_t;

#define LIS2DU12_WAKE_UP_THS   0x1CU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t wk_ths             : 6;
  uint8_t sleep_on           : 1;
  uint8_t single_double_tap  : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t single_double_tap  : 1;
  uint8_t sleep_on           : 1;
  uint8_t wk_ths             : 6;
#endif /* DRV_BYTE_ORDER */
} lis2du12_wake_up_ths_t;

#define LIS2DU12_WAKE_UP_DUR    0x1DU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sleep_dur      : 4;
  uint8_t not_used_01    : 1;
  uint8_t wake_dur       : 2;
  uint8_t ff_dur         : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ff_dur         : 1;
  uint8_t wake_dur       : 2;
  uint8_t not_used_01    : 1;
  uint8_t sleep_dur      : 4;
#endif /* DRV_BYTE_ORDER */
} lis2du12_wake_up_dur_t;

#define LIS2DU12_FREE_FALL     0x1EU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t ff_ths      : 3;
  uint8_t ff_dur      : 5;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ff_dur      : 5;
  uint8_t ff_ths      : 3;
#endif /* DRV_BYTE_ORDER */
} lis2du12_free_fall_t;

#define LIS2DU12_MD1_CFG        0x1FU
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used_01        : 1;
  uint8_t wu_dur_x4          : 1;
  uint8_t int1_6d            : 1;
  uint8_t int1_double_tap    : 1;
  uint8_t int1_ff            : 1;
  uint8_t int1_wu            : 1;
  uint8_t int1_single_tap    : 1;
  uint8_t int1_sleep_change  : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t int1_sleep_change  : 1;
  uint8_t int1_single_tap    : 1;
  uint8_t int1_wu            : 1;
  uint8_t int1_ff            : 1;
  uint8_t int1_double_tap    : 1;
  uint8_t int1_6d            : 1;
  uint8_t wu_dur_x4          : 1;
  uint8_t not_used_01        : 1;
#endif /* DRV_BYTE_ORDER */
} lis2du12_md1_cfg_t;

#define LIS2DU12_MD2_CFG       0x20U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t not_used_01        : 1;
  uint8_t pd_dis_int2        : 1;
  uint8_t int2_6d            : 1;
  uint8_t int2_double_tap    : 1;
  uint8_t int2_ff            : 1;
  uint8_t int2_wu            : 1;
  uint8_t int2_single_tap    : 1;
  uint8_t int2_sleep_change  : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t int2_sleep_change  : 1;
  uint8_t int2_single_tap    : 1;
  uint8_t int2_wu            : 1;
  uint8_t int2_ff            : 1;
  uint8_t int2_double_tap    : 1;
  uint8_t int2_6d            : 1;
  uint8_t pd_dis_int2        : 1;
  uint8_t not_used_01        : 1;
#endif /* DRV_BYTE_ORDER */
} lis2du12_md2_cfg_t;

#define LIS2DU12_WAKE_UP_SRC   0x21U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t z_wu            : 1;
  uint8_t y_wu            : 1;
  uint8_t x_wu            : 1;
  uint8_t wu_ia           : 1;
  uint8_t sleep_state     : 1;
  uint8_t ff_ia           : 1;
  uint8_t sleep_change_ia : 1;
  uint8_t not_used_01     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01     : 1;
  uint8_t sleep_change_ia : 1;
  uint8_t ff_ia           : 1;
  uint8_t sleep_state     : 1;
  uint8_t wu_ia           : 1;
  uint8_t x_wu            : 1;
  uint8_t y_wu            : 1;
  uint8_t z_wu            : 1;
#endif /* DRV_BYTE_ORDER */
} lis2du12_wake_up_src_t;

#define LIS2DU12_TAP_SRC       0x22U
typedef struct {
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t z_tap         : 1;
  uint8_t y_tap         : 1;
  uint8_t x_tap         : 1;
  uint8_t tap_sign      : 1;
  uint8_t double_tap_ia : 1;
  uint8_t single_tap_ia : 1;
  uint8_t tap_ia        : 1;
  uint8_t not_used_01   : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01   : 1;
  uint8_t tap_ia        : 1;
  uint8_t single_tap_ia : 1;
  uint8_t double_tap_ia : 1;
  uint8_t tap_sign      : 1;
  uint8_t x_tap         : 1;
  uint8_t y_tap         : 1;
  uint8_t z_tap         : 1;
#endif /* DRV_BYTE_ORDER */
} lis2du12_tap_src_t;

