stm32-hotspot/STM32U3-M2-Serial-Mem-EMS-Test-Code/Naquada/Parts/lis2du12_reg.h
typedef struct {
  uint8_t sw_reset           : 1; /* Restoring configuration registers */
  uint8_t boot               : 1; /* Restoring calibration parameters */
  uint8_t drdy_xl            : 1; /* Accelerometer data ready */
  uint8_t power_down         : 1; /* Monitors power-down. */
} lis2du12_status_t;
int32_t lis2du12_status_get(stmdev_ctx_t *ctx, lis2du12_status_t *val);

typedef struct {
  uint8_t sdo_pull_up         : 1; /* 1 = pull up enable */
  uint8_t sda_pull_up         : 1; /* 1 = pull up enable */
  uint8_t cs_pull_up          : 1; /* 1 = pull up enable */
  uint8_t int1_int2_push_pull : 1; /* 1 = push-pull / 0 = open-drain*/
  uint8_t int1_pull_down      : 1; /* 1 = pull-down always disabled (0=auto) */
  uint8_t int2_pull_down      : 1; /* 1 = pull-down always disabled (0=auto) */
} lis2du12_pin_conf_t;
int32_t lis2du12_pin_conf_set(stmdev_ctx_t *ctx, lis2du12_pin_conf_t *val);
int32_t lis2du12_pin_conf_get(stmdev_ctx_t *ctx, lis2du12_pin_conf_t *val);

typedef struct {
  uint8_t free_fall        :  1; /* free fall event */
  uint8_t wake_up          :  1; /* wake up event */
  uint8_t wake_up_z        :  1; /* wake up on Z axis event */
  uint8_t wake_up_y        :  1; /* wake up on Y axis event */
  uint8_t wake_up_x        :  1; /* wake up on X axis event */
  uint8_t single_tap       :  1; /* single-tap event */
  uint8_t double_tap       :  1; /* double-tap event */
  uint8_t tap_z            :  1; /* single-tap on Z axis event */
  uint8_t tap_y            :  1; /* single-tap on Y axis event */
  uint8_t tap_x            :  1; /* single-tap on X axis event */
  uint8_t tap_sign         :  1; /* sign of tap event (0-pos / 1-neg) */
  uint8_t six_d            :  1; /* orientation change (6D/4D detection) */
  uint8_t six_d_xl         :  1; /* X-axis low 6D/4D event (under threshold) */
  uint8_t six_d_xh         :  1; /* X-axis high 6D/4D event (over threshold) */
  uint8_t six_d_yl         :  1; /* Y-axis low 6D/4D event (under threshold) */
  uint8_t six_d_yh         :  1; /* Y-axis high 6D/4D event (over threshold) */
  uint8_t six_d_zl         :  1; /* Z-axis low 6D/4D event (under threshold) */
  uint8_t six_d_zh         :  1; /* Z-axis high 6D/4D event (over threshold) */
  uint8_t sleep_change     :  1; /* Act/Inact (or Vice-versa) status changed */
  uint8_t sleep_state      :  1; /* Act/Inact status flag (0-Act / 1-Inact) */
} lis2du12_all_sources_t;
int32_t lis2du12_all_sources_get(stmdev_ctx_t *ctx,
                                 lis2du12_all_sources_t *val);

typedef enum {
  LIS2DU12_OFF               = 0x00, /* in power down */
  LIS2DU12_1Hz6_ULP          = 0x01, /* @1Hz6(ultralow power) */
  LIS2DU12_3Hz_ULP           = 0x02, /* @3Hz (ultralow power) */
  LIS2DU12_6Hz_ULP           = 0x03, /* @6Hz (ultralow power) */
  LIS2DU12_6Hz               = 0x04, /* @6Hz (normal) */
  LIS2DU12_12Hz5             = 0x05, /* @12Hz5 (normal) */
  LIS2DU12_25Hz              = 0x06, /* @25Hz  (normal) */
  LIS2DU12_50Hz              = 0x07, /* @50Hz  (normal) */
  LIS2DU12_100Hz             = 0x08, /* @100Hz (normal) */
  LIS2DU12_200Hz             = 0x09, /* @200Hz (normal) */
  LIS2DU12_400Hz             = 0x0A, /* @400Hz (normal) */
  LIS2DU12_800Hz             = 0x0B, /* @800Hz (normal) */
  LIS2DU12_TRIG_PIN          = 0x0E, /* Single-shot high latency by INT2 */
  LIS2DU12_TRIG_SW           = 0x0F, /* Single-shot high latency by IF */
} lis2du12_odr_t;

typedef enum {
  LIS2DU12_2g   = 0,
  LIS2DU12_4g   = 1,
  LIS2DU12_8g   = 2,
  LIS2DU12_16g  = 3,
} lis2du12_fs_t;

typedef enum {
  LIS2DU12_ODR_div_2   = 0,
  LIS2DU12_ODR_div_4   = 1,
  LIS2DU12_ODR_div_8   = 2,
  LIS2DU12_ODR_div_16  = 3,
} lis2du12_bw_t;

typedef struct {
  lis2du12_odr_t odr;
  lis2du12_fs_t fs;
  lis2du12_bw_t bw;
} lis2du12_md_t;
int32_t lis2du12_mode_set(stmdev_ctx_t *ctx, lis2du12_md_t *val);
int32_t lis2du12_mode_get(stmdev_ctx_t *ctx, lis2du12_md_t *val);

int32_t lis2du12_trigger_sw(stmdev_ctx_t *ctx, lis2du12_md_t *val);

typedef struct {
  struct {
    float_t mg[3];
    int16_t raw[3];
  }xl;
  struct {
    float_t deg_c;
    int16_t raw;
  }heat;
} lis2du12_data_t;
int32_t lis2du12_data_get(stmdev_ctx_t *ctx, lis2du12_md_t *md,
                          lis2du12_data_t *data);

typedef enum {
  LIS2DU12_ST_DISABLE  = 0,
  LIS2DU12_ST_POSITIVE = 6,
  LIS2DU12_ST_NEGATIVE = 1,
} lis2du12_st_t;
int32_t lis2du12_self_test_sign_set(stmdev_ctx_t *ctx, lis2du12_st_t val);
int32_t lis2du12_self_test_start(stmdev_ctx_t *ctx, uint8_t val); /* valid values: 1 or 2 */
int32_t lis2du12_self_test_stop(stmdev_ctx_t *ctx);

typedef enum {
  LIS2DU12_BYPASS            = 0,
  LIS2DU12_FIFO              = 1,
  LIS2DU12_STREAM            = 6,
  LIS2DU12_STREAM_TO_FIFO    = 3, /* Dynamic-Stream, FIFO on Trigger */
  LIS2DU12_BYPASS_TO_STREAM  = 4, /* Bypass, Dynamic-Stream on Trigger */
  LIS2DU12_BYPASS_TO_FIFO    = 7, /* Bypass, FIFO on Trigger */
} lis2du12_fifo_operation_t;

typedef enum {
  LIS2DU12_8_BIT    = 0,
  LIS2DU12_16_BIT   = 1,
} lis2du12_fifo_store_t;

typedef struct {
  lis2du12_fifo_operation_t operation;
  lis2du12_fifo_store_t store;
  uint8_t watermark; /* (0 disable) max 127 @16bit, even and max 256 @8bit.*/
} lis2du12_fifo_md_t;
int32_t lis2du12_fifo_mode_set(stmdev_ctx_t *ctx, lis2du12_fifo_md_t *val);
int32_t lis2du12_fifo_mode_get(stmdev_ctx_t *ctx, lis2du12_fifo_md_t *val);

typedef struct {
  uint8_t fifo_fth         : 1; /* 1 = fifo threshold event */
  uint8_t fifo_ovr         : 1; /* 1 = fifo overrun event */
} lis2du12_fifo_status_t;
int32_t lis2du12_fifo_status_get(stmdev_ctx_t *ctx, lis2du12_fifo_status_t *val);

int32_t lis2du12_fifo_level_get(stmdev_ctx_t *ctx, lis2du12_fifo_md_t *md,
                                uint8_t *val);

typedef struct {
  struct {
    float_t mg[3];
    int16_t raw[3];
  }xl[2];
  struct {
    float_t deg_c;
    int16_t raw;
  }heat;
} lis2du12_fifo_data_t;
int32_t lis2du12_fifo_data_get(stmdev_ctx_t *ctx, lis2du12_md_t *md,
                               lis2du12_fifo_md_t *fmd,
                               lis2du12_fifo_data_t *data);

